Autodesk.Revit.DB.ExportFontInfo.DestinationFontName
The destination font name (the name of the font in the exported format).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ExportFontInfo.#ctor(System.String)
Constructs a new ExportFontInfo using the destination font name as input.
destinationFontName:
The destination font name (the name of the font in the exported format).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ExportFontInfo.#ctor(Autodesk.Revit.DB.ExportFontInfo)
Constructs a new copy of the input ExportFontInfo object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014